name: "double_bls"
backend: "python"

input [
  {
    name: "MODEL_NAME"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

input [
  {
    name: "image"
    data_type: TYPE_FP32
    dims: [ -1, 3507, 2550, 3 ]
  }
]

output [
  {
    name: "word_segments"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]


instance_group [{ kind: KIND_CPU }]
