name: "bls_sync"
backend: "python"

input [
  {
    name: "MODEL_NAME"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

input [
  {
    name: "INPUT0"
    data_type: TYPE_FP32
    dims: [ -1, 3, 64, 64 ]
  }
]

output [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [ -1, 1000 ]
  }
]


instance_group [{ kind: KIND_CPU }]