name: "equivalentnet"
platform: "pytorch_libtorch"
max_batch_size: 1024

input [
  {
    name: "INPUT__0"
    data_type: TYPE_FP32
    dims: [ 1, 64, 64 ]
  }
]

output [
  {
    name: "OUTPUT__0"
    data_type: TYPE_FP32
    dims: [ 2 ]
  }
]
